$(function () {
    var addUl = $('#address-management');

//<------------------------------事件委托开始------------------------------>


//<------------此行代码为事件委托 委托到_delete的父级（addUl）的身上--------------->
//<---------------------delegate是事件委托的意思------------------------>
//<把.delete（用class名）的事件委托给addUl，点击.delete的时候移除当前点的.delete的父级的li>
//<----------------------delegate----------------->


    addUl.delegate('.delete', 'click', function () {
        $(this).parents('li').remove();
    });

//<------------------------------事件委托结束------------------------------>
});
